#ifndef LSD_3ACC8_H
#define LSD_3ACC8_H

#include <common.h>

typedef struct class_3ACC8_vtable {
    /* 0x000 800866e8 */ u32 value;
    /* 0x004 800866ec */ void (*Destroy)(void *);
    /* 0x008 800866f0 */ void (*Construct)(void *, s32, s32);
    /* 0x00C 800866f4 */ void (*Cleanup)(void *);
    /* 0x010 800866f8 */ void (*Unk3)(void *);
    /* 0x014 800866fc */ void (*Unk4)(void *);
    /* 0x018 80086700 */ void (*Unk5)(void *);
    /* 0x01C 80086704 */ void (*Unk6)(void *);
    /* 0x020 80086708 */ void (*Unk7)(void *);
    /* 0x024 8008670c */ void (*Unk8)(void *);
    /* 0x028 80086710 */ void (*Unk9)(void *);
    /* 0x02C 80086714 */ void (*Unk10)(void *);
    /* 0x030 80086718 */ void (*Unk11)(void *);
    /* 0x034 8008671c */ void (*Unk12)(void *);
    /* 0x038 80086720 */ void (*Unk13)(void *);
    /* 0x03C 80086724 */ void (*Unk14)(void *);
    /* 0x040 80086728 */ void (*Unk15)(void *);
    /* 0x044 8008672c */ void (*Unk16)(void *);
    /* 0x048 80086730 */ void (*Unk17)(void *);
    /* 0x04C 80086734 */ void (*Unk18)(void *);
    /* 0x050 80086738 */ void (*Unk19)(void *);
    /* 0x054 8008673c */ void (*Unk20)(void *);
    /* 0x058 80086740 */ void (*Unk21)(void *);
    /* 0x05C 80086744 */ void (*Unk22)(void *);
    /* 0x060 80086748 */ void (*Unk23)(void *);
    /* 0x064 8008674c */ void (*Unk24)(void *);
    /* 0x068 80086750 */ void (*Unk25)(void *);
    /* 0x06C 80086754 */ void (*Unk26)(void *);
    /* 0x070 80086758 */ void (*Unk27)(void *);
    /* 0x074 8008675c */ void (*Unk28)(void *);
    /* 0x078 80086760 */ void (*Unk29)(void *);
    /* 0x07C 80086764 */ void (*Unk30)(void *);
    /* 0x080 80086768 */ void (*Unk31)(void *);
    /* 0x084 8008676c */ void (*Unk32)(void *);
    /* 0x088 80086770 */ void (*Unk33)(void *);
    /* 0x08C 80086774 */ void (*Unk34)(void *);
    /* 0x090 80086778 */ void (*Unk35)(void *);
    /* 0x094 8008677c */ void (*Unk36)(void *);
    /* 0x098 80086780 */ void (*Unk37)(void *);
    /* 0x09C 80086784 */ void (*Unk38)(void *);
    /* 0x0A0 80086788 */ void (*Unk39)(void *);
    /* 0x0A4 8008678c */ void (*Unk40)(void *);
    /* 0x0A8 80086790 */ void (*Unk41)(void *);
    /* 0x0AC 80086794 */ void (*Unk42)(void *);
    /* 0x0B0 80086798 */ void (*Unk43)(void *);
    /* 0x0B4 8008679c */ void (*Unk44)(void *);
    /* 0x0B8 800867a0 */ void (*Unk45)(void *);
    /* 0x0BC 800867a4 */ void (*Unk46)(void *);
    /* 0x0C0 800867a8 */ void (*Unk47)(void *);
    /* 0x0C4 800867ac */ void (*Unk48)(void *);
    /* 0x0C8 800867b0 */ void (*Unk49)(void *);
    /* 0x0CC 800867b4 */ void (*Unk50)(void *);
    /* 0x0D0 800867b8 */ void (*Unk51)(void *);
    /* 0x0D4 800867bc */ void (*Unk52)(void *);
    /* 0x0D8 800867c0 */ void (*Unk53)(void *);
    /* 0x0DC 800867c4 */ void (*Unk54)(void *, s32);
    /* 0x0E0 800867c8 */ void (*Unk55)(void *);
    /* 0x0E4 800867cc */ void (*Unk56)(void *);
    /* 0x0E8 800867d0 */ void (*Unk57)(void *);
    /* 0x0EC 800867d4 */ void (*Unk58)(void *);
    /* 0x0F0 800867d8 */ void (*Unk59)(void *);
    /* 0x0F4 800867dc */ void (*Unk60)(void *);
    /* 0x0F8 800867e0 */ void (*Unk61)(void *);
    /* 0x0FC 800867e4 */ void (*Unk62)(void *);
    /* 0x100 800867e8 */ void (*Unk63)(void *, s32 **, s32);
    /* 0x104 800867ec */ void (*Unk64)(void *);
    /* 0x108 800867f0 */ void (*Unk65)(void *);
    /* 0x10C 800867f4 */ void (*Unk66)(void *);
    /* 0x110 800867f8 */ void (*Unk67)(void *);
    /* 0x114 800867fc */ void (*Unk68)(void *);
    /* 0x118 80086800 */ void (*Unk69)(void *);
    /* 0x11C 80086804 */ void (*Unk70)(void *);
    /* 0x120 80086808 */ void (*Unk71)(void *);
    /* 0x124 8008680c */ void (*Unk72)(void *);
    /* 0x128 80086810 */ void (*Unk73)(void *);
    /* 0x12C 80086814 */ void (*Unk74)(void *);
    /* 0x130 80086818 */ void (*Unk75)(void *);
    /* 0x134 8008681c */ void (*Unk76)(void *);
    /* 0x138 80086820 */ void (*Unk77)(void *);
    /* 0x13C 80086824 */ void (*Unk78)(void *);
    /* 0x140 80086828 */ void (*Unk79)(void *);
} class_3ACC8_vtable_t;

typedef struct class_3ACC8 {
    /* 0x00 */ class_3ACC8_vtable_t *vtable;
    /* 0x04 */ s32 m_Unk0;
    /* 0x08 */ s32 m_Unk1;
    /* 0x0C */ s32 m_Unk2;
    /* 0x10 */ s32 m_Unk3;
    /* 0x14 */ s32 m_Unk4;
    /* 0x18 */ s32 m_Unk5;
    /* 0x1C */ s32 m_Unk6;
    /* 0x20 */ s32 m_Unk7;
    /* 0x24 */ s32 m_Unk8;
    /* 0x28 */ s32 m_Unk9;
    /* 0x2C */ s32 m_Unk10;
    /* 0x30 */ s32 m_Unk11;
    /* 0x34 */ u16 m_Unk12_1;
    /* 0x36 */ u16 m_Unk12_2;
    /* 0x38 */ s32 m_Unk13;
    /* 0x3C */ s32 m_Unk14;
    /* 0x40 */ s32 m_Unk15;
    /* 0x44 */ s32 m_Unk16;
    /* 0x48 */ s32 m_Unk17;
    /* 0x4C */ s32 m_Unk18;
    /* 0x50 */ s32 m_Unk19;
    /* 0x54 */ s32 m_Unk20;
    /* 0x58 */ s32 m_Unk21;
    /* 0x5C */ s32 m_Unk22;
    /* 0x60 */ s32 m_Unk23;
    /* 0x64 */ s32 m_Unk24;
    /* 0x68 */ s32 m_Unk25;
    /* 0x6C */ s32 m_Unk26;
    /* 0x70 */ s32 m_Unk27;
    /* 0x74 */ s32 m_Unk28;
    /* 0x78 */ s32 m_Unk29;
    /* 0x7C */ s32 m_Unk30;
    /* 0x80 */ s32 m_Unk31;
    /* 0x84 */ s32 m_Unk32;
    /* 0x88 */ s32 m_Unk33;
    /* 0x8C */ s32 m_Unk34;
    /* 0x90 */ s32 m_Unk35;
    /* 0x94 */ s32 m_Unk36;
    /* 0x98 */ s32 m_Unk37;
    /* 0x9C */ s32 m_Unk38;
    /* 0xA0 */ s32 m_Unk39;
    /* 0xA4 */ s32 m_Unk40;
    /* 0xA8 */ s32 m_Unk41;
    /* 0xAC */ s32 m_Unk42;
    /* 0xB0 */ s32 m_Unk43;
    /* 0xB4 */ s32 m_Unk44;
    /* 0xB8 */ s32 m_Unk45;
    /* 0xBC */ s32 m_Unk46;
    /* 0xC0 */ s32 m_Unk47;
    /* 0xC4 */ s32 m_Unk48;
    /* 0xC8 */ s32 m_Unk49;
    /* 0xCC */ s32 m_Unk50;
    /* 0xD0 */ s32 m_Unk51;
    /* 0xD4 */ s32 m_Unk52;
    /* 0xD8 */ s32 m_Unk53;
    /* 0xDC */ s32 m_Unk54;
    /* 0xE0 */ s32 m_Unk55;
    /* 0xE4 */ s32 m_Unk56;
    /* 0xE8 */ s32 m_Unk57;
    /* 0xEC */ s32 m_Unk58;
    /* 0xF0 */ s32 m_Unk59;
    /* 0xF4 */ s32 m_Unk60;
    /* 0xF8 */ s32 m_Unk61;
    /* 0xFC */ s32 m_Unk62;
    /* 0x100 */ s32 m_Unk63;
    /* 0x104 */ s32 m_Unk64;
    /* 0x108 */ s32 m_Unk65;
    /* 0x10C */ s32 m_Unk66;
    /* 0x110 */ s32 m_Unk67;
    /* 0x114 */ s32 m_Unk68;
    /* 0x118 */ s32 m_Unk69;
    /* 0x11C */ s32 m_Unk70;
    /* 0x120 */ s32 m_Unk71;
    /* 0x124 */ s32 m_Unk72;
    /* 0x128 */ s32 m_Unk73;
    /* 0x12C */ s32 m_Unk74;
    /* 0x130 */ s32 m_Unk75;
    /* 0x134 */ s32 m_Unk76;
    /* 0x138 */ s32 m_Unk77;
    /* 0x13C */ s32 m_Unk78;
    /* 0x140 */ s32 m_Unk79;
    /* 0x144 */ s32 m_Unk80;
    /* 0x148 */ s32 m_Unk81;
    /* 0x14C */ s32 m_Unk82;
    /* 0x150 */ s32 m_Unk83;
    /* 0x154 */ s32 m_Unk84;
    /* 0x158 */ s32 m_Unk85;
    /* 0x15C */ s32 m_Unk86;
    /* 0x160 */ s32 m_Unk87;
    /* 0x164 */ s32 m_Unk88;
    /* 0x168 */ s32 m_Unk89;
    /* 0x16C */ s32 m_Unk90;
    /* 0x170 */ s32 m_Unk91;
    /* 0x174 */ s32 m_Unk92;
    /* 0x178 */ s32 m_Unk93;
    /* 0x17C */ s32 m_Unk94;
    /* 0x180 */ s32 m_Unk95;
    /* 0x184 */ s32 m_Unk96;
    /* 0x188 */ s32 m_Unk97;
    /* 0x18C */ s32 m_Unk98;
    /* 0x190 */ s32 m_Unk99;
    /* 0x194 */ s32 m_Unk100;
    /* 0x198 */ s32 m_Unk101;
    /* 0x19C */ s32 m_Unk102;
    /* 0x1A0 */ s32 m_Unk103;
    /* 0x1A4 */ s32 m_Unk104;
    /* 0x1A8 */ s32 m_Unk105;
    /* 0x1AC */ s32 m_Unk106;
    /* 0x1B0 */ s32 m_Unk107;
    /* 0x1B4 */ s32 m_Unk108;
    /* 0x1B8 */ s32 m_Unk109;
    /* 0x1BC */ s32 m_Unk110;
    /* 0x1C0 */ s32 m_Unk111;
    /* 0x1C4 */ s32 m_Unk112;
    /* 0x1C8 */ s32 m_Unk113;
    /* 0x1CC */ s32 m_Unk114;
    /* 0x1D0 */ s32 m_Unk115;
    /* 0x1D4 */ s32 m_Unk116;
    /* 0x1D8 */ s32 m_Unk117;
    /* 0x1DC */ s32 m_Unk118;
    /* 0x1E0 */ s32 m_Unk119;
    /* 0x1E4 */ s32 m_Unk120;
    /* 0x1E8 */ s32 m_Unk121;
} class_3ACC8_t;

class_3ACC8_vtable_t *func_8004D244(void);

#endif