#ifndef LSD_48768_H
#define LSD_48768_H

#include <common.h>

typedef struct class_48768_vtable {
    /* 0x000 80087aac */ u32 value;
    /* 0x004 80087ab0 */ void (*Destroy)(void *);
    /* 0x008 80087ab4 */ void (*Construct)(void *, s32);
    /* 0x00C 80087ab8 */ void (*Cleanup)(void *);
    /* 0x010 80087abc */ void (*Unk3)(void *);
    /* 0x014 80087ac0 */ void (*Unk4)(void *);
    /* 0x018 80087ac4 */ void (*Unk5)(void *);
    /* 0x01C 80087ac8 */ void (*Unk6)(void *);
    /* 0x020 80087acc */ void (*Unk7)(void *);
    /* 0x024 80087ad0 */ void (*Unk8)(void *);
    /* 0x028 80087ad4 */ void (*Unk9)(void *);
    /* 0x02C 80087ad8 */ void (*Unk10)(void *);
    /* 0x030 80087adc */ void (*Unk11)(void *);
    /* 0x034 80087ae0 */ void (*Unk12)(void *);
    /* 0x038 80087ae4 */ void (*Unk13)(void *);
    /* 0x03C 80087ae8 */ void (*Unk14)(void *);
    /* 0x040 80087aec */ void (*Unk15)(void *, void *);
    /* 0x044 80087af0 */ void (*Unk16)(void *);
    /* 0x048 80087af4 */ void (*Unk17)(void *);
    /* 0x04C 80087af8 */ void (*Unk18)(void *);
    /* 0x050 80087afc */ void (*Unk19)(void *);
    /* 0x054 80087b00 */ void (*Unk20)(void *);
    /* 0x058 80087b04 */ void (*Unk21)(void *);
    /* 0x05C 80087b08 */ void (*Unk22)(void *);
    /* 0x060 80087b0c */ void (*Unk23)(void *);
    /* 0x064 80087b10 */ void (*Unk24)(void *);
    /* 0x068 80087b14 */ void (*Unk25)(void *);
    /* 0x06C 80087b18 */ void (*Unk26)(void *, s32);
    /* 0x070 80087b1c */ void (*Unk27)(void *, s32);
    /* 0x074 80087b20 */ void (*Unk28)(void *);
    /* 0x078 80087b24 */ void (*Unk29)(void *);
    /* 0x07C 80087b28 */ void (*Unk30)(void *);
    /* 0x080 80087b2c */ void (*Unk31)(void *);
    /* 0x084 80087b30 */ void (*Unk32)(void *);
    /* 0x088 80087b34 */ void (*Unk33)(void *);
    /* 0x08C 80087b38 */ void (*Unk34)(void *);
    /* 0x090 80087b3c */ void (*Unk35)(void *);
    /* 0x094 80087b40 */ void (*Unk36)(void *);
    /* 0x098 80087b44 */ void (*Unk37)(void *);
    /* 0x09C 80087b48 */ void (*Unk38)(void *);
    /* 0x0A0 80087b4c */ void (*Unk39)(void *);
    /* 0x0A4 80087b50 */ void (*Unk40)(void *);
    /* 0x0A8 80087b54 */ void (*Unk41)(void *);
    /* 0x0AC 80087b58 */ void (*Unk42)(void *);
    /* 0x0B0 80087b5c */ void (*Unk43)(void *);
    /* 0x0B4 80087b60 */ void (*Unk44)(void *);
    /* 0x0B8 80087b64 */ void (*Unk45)(void *);
    /* 0x0BC 80087b68 */ void (*Unk46)(void *);
    /* 0x0C0 80087b6c */ void (*Unk47)(void *);
    /* 0x0C4 80087b70 */ void (*Unk48)(void *);
    /* 0x0C8 80087b74 */ void (*Unk49)(void *);
    /* 0x0CC 80087b78 */ void (*Unk50)(void *);
    /* 0x0D0 80087b7c */ void (*Unk51)(void *);
    /* 0x0D4 80087b80 */ void (*Unk52)(void *, const char *, void *);
    /* 0x0D8 80087b84 */ void (*Unk53)(void *, s32);
    /* 0x0DC 80087b88 */ void (*Unk54)(void *);
    /* 0x0E0 80087b8c */ void (*Unk55)(void *);
    /* 0x0E4 80087b90 */ void (*Unk56)(void *);
    /* 0x0E8 80087b94 */ void (*Unk57)(void *);
    /* 0x0EC 80087b98 */ void (*Unk58)(void *);
    /* 0x0F0 80087b9c */ void (*Unk59)(void *);
    /* 0x0F4 80087ba0 */ void (*Unk60)(void *);
    /* 0x0F8 80087ba4 */ void (*Unk61)(void *);
    /* 0x0FC 80087ba8 */ void (*Unk62)(void *);
    /* 0x100 80087bac */ void (*Unk63)(void *);
    /* 0x104 80087bb0 */ void (*Unk64)(void *);
    /* 0x108 80087bb4 */ void (*Unk65)(void *);
    /* 0x10C 80087bb8 */ void (*Unk66)(void *);
    /* 0x110 80087bbc */ void (*Unk67)(void *);
    /* 0x114 80087bc0 */ void (*Unk68)(void *);
    /* 0x118 80087bc4 */ void (*Unk69)(void *);
    /* 0x11C 80087bc8 */ void (*Unk70)(void *);
    /* 0x120 80087bcc */ void (*Unk71)(void *);
    /* 0x124 80087bd0 */ void (*Unk72)(void *);
    /* 0x128 80087bd4 */ void (*Unk73)(void *);
} class_48768_vtable_t;

typedef struct class_48768 {
    /* 0x00 */ class_48768_vtable_t *vtable;
    /* 0x04 */ s32 m_Unk0;
    /* 0x08 */ s32 m_Unk1;
    /* 0x0C */ s32 m_Unk2;
    /* 0x10 */ s32 m_Unk3;
    /* 0x14 */ s32 m_Unk4;
    /* 0x18 */ s32 m_Unk5;
    /* 0x1C */ s32 m_Unk6;
    /* 0x20 */ s32 m_Unk7;
    /* 0x24 */ s32 m_Unk8;
    /* 0x28 */ s32 m_Unk9;
    /* 0x2C */ s32 m_Unk10;
    /* 0x30 */ s32 m_Unk11;
    /* 0x34 */ s32 m_Unk12;
    /* 0x38 */ s32 m_Unk13;
    /* 0x3C */ s32 m_Unk14;
    /* 0x40 */ s32 m_Unk15;
    /* 0x44 */ s32 m_Unk16;
    /* 0x48 */ s32 m_Unk17;
    /* 0x4C */ s32 m_Unk18;
    /* 0x50 */ s32 m_Unk19;
    /* 0x54 */ s32 m_Unk20;
    /* 0x58 */ s32 m_Unk21;
    /* 0x5C */ s32 m_Unk22;
    /* 0x60 */ s32 m_Unk23;
    /* 0x64 */ s32 m_Unk24;
    /* 0x68 */ s32 m_Unk25;
    /* 0x6C */ s32 m_Unk26;
    /* 0x70 */ s32 m_Unk27;
    /* 0x74 */ s32 m_Unk28;
    /* 0x78 */ s32 m_Unk29;
    /* 0x7C */ s32 m_Unk30;
    /* 0x80 */ s32 m_Unk31;
    /* 0x84 */ s32 m_Unk32;
    /* 0x88 */ s32 m_Unk33;
    /* 0x8C */ s32 m_Unk34;
    /* 0x90 */ s32 m_Unk35;
    /* 0x94 */ s32 m_Unk36;
    /* 0x98 */ s32 m_Unk37;
    /* 0x9C */ s32 m_Unk38;
    /* 0xA0 */ s32 m_Unk39;
    /* 0xA4 */ void *m_Unk40;
    /* 0xA8 */ s32 m_Unk41;
    /* 0xAC */ s32 m_Unk42;
    /* 0xB0 */ s32 m_Unk43;
    /* 0xB4 */ s32 m_Unk44;
    /* 0xB8 */ s32 m_Unk45;
    /* 0xBC */ s32 m_Unk46;
    /* 0xC0 */ s32 m_Unk47;
    /* 0xC4 */ s32 m_Unk48;
    /* 0xC8 */ s32 m_Unk49;
    /* 0xCC */ s32 m_Unk50;
    /* 0xD0 */ s32 m_Unk51;
    /* 0xD4 */ s32 m_Unk52;
    /* 0xD8 */ s32 m_Unk53;
    /* 0xDC */ s32 m_Unk54;
    /* 0xE0 */ s32 m_Unk55;
    /* 0xE4 */ s32 m_Unk56;
    /* 0xE8 */ s32 m_Unk57;
    /* 0xEC */ s32 m_Unk58;
    /* 0xF0 */ s32 m_Unk59;
    /* 0xF4 */ s32 m_Unk60;
    /* 0xF8 */ s32 m_Unk61;
    /* 0xFC */ s32 m_Unk62;
    /* 0x100 */ s32 m_Unk63;
    /* 0x104 */ s32 m_Unk64;
    /* 0x108 */ s32 m_Unk65;
    /* 0x10C */ s32 m_Unk66;
    /* 0x110 */ s32 m_Unk67;
    /* 0x114 */ s32 m_Unk68;
    /* 0x118 */ s32 m_Unk69;
    /* 0x11C */ s32 m_Unk70;
    /* 0x120 */ s32 m_Unk71;
    /* 0x124 */ s32 m_Unk72;
    /* 0x128 */ s32 m_Unk73;
    /* 0x12C */ s32 m_Unk74;
    /* 0x130 */ s32 m_Unk75;
    /* 0x134 */ s32 m_Unk76;
    /* 0x138 */ s32 m_Unk77;
    /* 0x13C */ s32 m_Unk78;
    /* 0x140 */ s32 m_Unk79;
    /* 0x144 */ s32 m_Unk80;
    /* 0x148 */ s32 m_Unk81;
    /* 0x14C */ s32 m_Unk82;
    /* 0x150 */ s32 m_Unk83;
    /* 0x154 */ s32 m_Unk84;
    /* 0x158 */ s32 m_Unk85;
    /* 0x15C */ s32 m_Unk86;
    /* 0x160 */ s32 m_Unk87;
    /* 0x164 */ s32 m_Unk88;
    /* 0x168 */ s32 m_Unk89;
    /* 0x16C */ s32 m_Unk90;
    /* 0x170 */ s32 m_Unk91;
    /* 0x174 */ s32 m_Unk92;
    /* 0x178 */ s32 m_Unk93;
    /* 0x17C */ s32 m_Unk94;
    /* 0x180 */ s32 m_Unk95;
    /* 0x184 */ s32 m_Unk96;
    /* 0x188 */ s32 m_Unk97;
    /* 0x18C */ s32 m_Unk98;
    /* 0x190 */ s32 m_Unk99;
    /* 0x194 */ s32 m_Unk100;
    /* 0x198 */ s32 m_Unk101;
    /* 0x19C */ s32 m_Unk102;
    /* 0x1A0 */ s32 m_Unk103;
    /* 0x1A4 */ s32 m_Unk104;
    /* 0x1A8 */ s32 m_Unk105;
    /* 0x1AC */ s32 m_Unk106;
    /* 0x1B0 */ s32 m_Unk107;
    /* 0x1B4 */ s32 m_Unk108;
    /* 0x1B8 */ s32 m_Unk109;
    /* 0x1BC */ s32 m_Unk110;
    /* 0x1C0 */ s32 m_Unk111;
    /* 0x1C4 */ s32 m_Unk112;
    /* 0x1C8 */ s32 m_Unk113;
    /* 0x1CC */ s32 m_Unk114;
    /* 0x1D0 */ s32 m_Unk115;
    /* 0x1D4 */ s32 m_Unk116;
    /* 0x1D8 */ s32 m_Unk117;
    /* 0x1DC */ s32 m_Unk118;
    /* 0x1E0 */ s32 m_Unk119;
    /* 0x1E4 */ s32 m_Unk120;
    /* 0x1E8 */ s32 m_Unk121;
    /* 0x1EC */ s32 m_Unk122;
    /* 0x1F0 */ s32 m_Unk123;
    /* 0x1F4 */ s32 m_Unk124;
    /* 0x1F8 */ s32 m_Unk125;
    /* 0x1FC */ s32 m_Unk126;
    /* 0x200 */ s32 m_Unk127;
    /* 0x204 */ s32 m_Unk128;
    /* 0x208 */ s32 m_Unk129;
    /* 0x20C */ s32 m_Unk130;
    /* 0x210 */ s32 m_Unk131;
    /* 0x214 */ s32 m_Unk132;
    /* 0x218 */ s32 m_Unk133;
    /* 0x21C */ s32 m_Unk134;
    /* 0x220 */ s32 m_Unk135;
    /* 0x224 */ s32 m_Unk136;
    s32 m_Unk137;
    s32 m_Unk138;
    s32 m_Unk139;
    s32 m_Unk140;
    s32 m_Unk141;
    s32 m_Unk142;
    void *m_Unk143;
    s32 m_Unk144;
    s32 m_Unk145;
} class_48768_t;

class_48768_vtable_t *func_80058764(void);

#endif