#ifndef LSD_55DD4_H
#define LSD_55DD4_H

#include "common.h"

typedef struct class_55DD4_vtable {
    /* 0x000 8008a6c4 */ u32 value;
    /* 0x004 8008a6c8 */ void (*Destroy)(void *);
    /* 0x008 8008a6cc */ void *(*Construct)(void *, s32, s32);
    /* 0x00C 8008a6d0 */ void (*Cleanup)(void *);
    /* 0x010 8008a6d4 */ void (*Unk3)(void *, s32);
    /* 0x014 8008a6d8 */ void (*Unk4)(void *, s32);
    /* 0x018 8008a6dc */ void (*Unk5)(void *);
    /* 0x01C 8008a6e0 */ void (*Unk6)(void *);
    /* 0x020 8008a6e4 */ void (*Unk7)(void *);
    /* 0x024 8008a6e8 */ void (*Unk8)(void *);
    /* 0x028 8008a6ec */ void (*Unk9)(void *);
    /* 0x02C 8008a6f0 */ void (*Unk10)(void *);
    /* 0x030 8008a6f4 */ void (*Unk11)(void *);
    /* 0x034 8008a6f8 */ void (*Unk12)(void *);
    /* 0x038 8008a6fc */ void (*Unk13)(void *);
    /* 0x03C 8008a700 */ s32 dummy1;
    /* 0x040 8008a704 */ void (*Unk15)(void *);
    /* 0x044 8008a708 */ void (*Unk16)(void *);
    /* 0x048 8008a70c */ void (*Unk17)(void *);
    /* 0x04C 8008a710 */ void (*Unk18)(void *, s32, s32, s32, s32);
    /* 0x050 8008a714 */ void (*Unk19)(void *);
    /* 0x054 8008a718 */ void (*Unk20)(void *);
    /* 0x058 8008a71c */ void (*Unk21)(void *);
    /* 0x05C 8008a720 */ void (*Unk22)(void *);
    /* 0x060 8008a724 */ void (*Unk23)(void *);
    /* 0x064 8008a728 */ void (*Unk24)(void *);
    /* 0x068 8008a72c */ void (*Unk25)(void *);
    /* 0x06C 8008a730 */ void (*Unk26)(void *);
    /* 0x070 8008a734 */ void (*Unk27)(void *);
    /* 0x074 8008a738 */ void (*Unk28)(void *);
    /* 0x078 8008a73c */ void (*Unk29)(void *);
    /* 0x07C 8008a740 */ void (*Unk30)(void *);
    /* 0x080 8008a744 */ void (*Unk31)(void *);
    /* 0x084 8008a748 */ void (*Unk32)(void *);
    /* 0x088 8008a74c */ void (*Unk33)(void *);
    /* 0x08C 8008a750 */ void (*Unk34)(void *);
    /* 0x090 8008a754 */ void (*Unk35)(void *);
    /* 0x094 8008a758 */ void (*Unk36)(void *);
    /* 0x098 8008a75c */ void (*Unk37)(void *, s32, s32);
    /* 0x09C 8008a760 */ void (*Unk38)(void *);
    /* 0x0A0 8008a764 */ void (*Unk39)(void *);
    /* 0x0A4 8008a768 */ void (*Unk40)(void *);
    /* 0x0A8 8008a76c */ void (*Unk41)(void *);
    /* 0x0AC 8008a770 */ void (*Unk42)(void *);
    /* 0x0B0 8008a774 */ void (*Unk43)(void *);
    /* 0x0B4 8008a778 */ void (*Unk44)(void *);
    /* 0x0B8 8008a77c */ void (*Unk45)(void *);
    /* 0x0BC 8008a780 */ void (*Unk46)(void *);
    /* 0x0C0 8008a784 */ void (*Unk47)(void *);
    /* 0x0C4 8008a788 */ void (*Unk48)(void *, s32, s32);
    /* 0x0C8 8008a78c */ void (*Unk49)(void *);
    /* 0x0CC 8008a790 */ void (*Unk50)(void *);
    /* 0x0D0 8008a794 */ void (*Unk51)(void *);
    /* 0x0D4 8008a798 */ void (*Unk52)(void *);
    /* 0x0D8 8008a79c */ void (*Unk53)(void *);
    /* 0x0DC 8008a7a0 */ void (*Unk54)(void *);
    /* 0x0E0 8008a7a4 */ void (*Unk55)(void *, s32, s32);
    /* 0x0E4 8008a7a8 */ void (*Unk56)(void *, s32);
    /* 0x0E8 8008a7ac */ void (*Unk57)(void *);
    /* 0x0EC 8008a7b0 */ void (*Unk58)(void *);
    /* 0x0F0 8008a7b4 */ void (*Unk59)(void *, s32);
    /* 0x0F4 8008a7b8 */ s32 (*Unk60)(void *, s32);
    /* 0x0F8 8008a7bc */ void (*Unk61)(void *);
    /* 0x0FC 8008a7c0 */ void (*Unk62)(void *);
    /* 0x100 8008a7c4 */ s32 (*Unk63)(void *);
    /* 0x104 8008a7c8 */ void (*Unk64)(void *);
    /* 0x108 8008a7cc */ void (*Unk65)(void *, s32);
    /* 0x10C 8008a7d0 */ void (*Unk66)(void *, s32);
    /* 0x110 8008a7d4 */ void (*Unk67)(void *);
    /* 0x114 8008a7d8 */ void (*Unk68)(void *);
    /* 0x118 8008a7dc */ void (*Unk69)(void *);
    /* 0x11C 8008a7e0 */ void (*Unk70)(void *);
    /* 0x120 8008a7e4 */ void (*Unk71)(void *);
    /* 0x124 8008a7e8 */ void (*Unk72)(void *);
    /* 0x128 8008a7ec */ void (*Unk73)(void *, s32);
    /* 0x12C 8008a7f0 */ void (*Unk74)(void *);
    /* 0x130 8008a7f4 */ void (*Unk75)(void *);
    /* 0x134 8008a7f8 */ void (*Unk76)(void *, s32, s32);
    /* 0x138 8008a7fc */ void (*Unk77)(void *);
    /* 0x13C 8008a800 */ void (*Unk78)(void *, s32);
    /* 0x140 8008a804 */ void (*Unk79)(void *);
} class_55DD4_vtable_t;

typedef struct class_55DD4 {
    /* 0x00 */ class_55DD4_vtable_t *vtable;
    /* 0x04 */ s32 m_Unk0;
    /* 0x08 */ s32 m_Unk1;
    /* 0x0C */ s32 m_Unk2;
    /* 0x10 */ s32 m_Unk3;
    /* 0x14 */ s32 m_Unk4;
    /* 0x18 */ s32 m_Unk5;
    /* 0x1C */ s32 m_Unk6;
    /* 0x20 */ s32 m_Unk7;
    /* 0x24 */ s32 m_Unk8;
    /* 0x28 */ s32 m_Unk9;
    /* 0x2C */ s32 m_Unk10;
    /* 0x30 */ s32 m_Unk11;
    /* 0x34 */ s32 m_Unk12;
    /* 0x38 */ s32 m_Unk13;
    /* 0x3C */ s32 m_Unk14;
    /* 0x40 */ s32 m_Unk15;
    /* 0x44 */ s32 m_Unk16;
    /* 0x48 */ s32 m_Unk17;
    /* 0x4C */ s32 m_Unk18;
    /* 0x50 */ s32 m_Unk19;
    /* 0x54 */ s32 m_Unk20;
    /* 0x58 */ s32 m_Unk21;
    /* 0x5C */ void *m_Unk22;
    /* 0x60 */ s32 m_Unk23;
    /* 0x64 */ s32 m_Unk24;
    /* 0x68 */ s32 m_Unk25;
    /* 0x6C */ s32 m_Unk26;
    /* 0x70 */ void **m_Unk27;
    /* 0x74 */ u32 m_Unk28;
    /* 0x78 */ s32 m_Unk29;
    /* 0x7C */ s32 m_Unk30;
    /* 0x80 */ s32 m_Unk31;
    /* 0x84 */ s32 m_Unk32;
    /* 0x88 */ s32 m_Unk33;
    /* 0x8C */ s32 m_Unk34;
    /* 0x90 */ s32 m_Unk35;
    /* 0x94 */ s32 m_Unk36;
    /* 0x98 */ s32 m_Unk37;
} class_55DD4_t;

// class_55DD4_t *class_55DD4_create(s32 Unk1, s32 Unk2);
class_55DD4_vtable_t *class_55DD4_get_vtable();

#endif // LSD_55DD4_H