#ifndef LSD_DREAM_SYS_H
#define LSD_DREAM_SYS_H

#include <common.h>

typedef enum {
    MOVE_NONE = 0,
    MOVE_FORWARD = 1,
    MOVE_BACKWARDS = 2,
    MOVE_LEFT = 3,
    MOVE_RIGHT = 4,

    MOVE_COUNT
} dream_sys_move_state_t;

typedef struct dream_sys_vtable {
    /* 0x000 80087bdc */ u32 value;
    /* 0x004 80087be0 */ void (*Unk0)(void *);
    /* 0x008 80087be4 */ void (*Unk1)(void *);
    /* 0x00C 80087be8 */ void (*Unk2)(void *);
    /* 0x010 80087bec */ void (*Unk3)(void *);
    /* 0x014 80087bf0 */ void (*Unk4)(void *);
    /* 0x018 80087bf4 */ void (*Unk5)(void *);
    /* 0x01C 80087bf8 */ void (*Unk6)(void *);
    /* 0x020 80087bfc */ void (*Unk7)(void *);
    /* 0x024 80087c00 */ void (*Unk8)(void *);
    /* 0x028 80087c04 */ void (*Unk9)(void *);
    /* 0x02C 80087c08 */ void (*Unk10)(void *);
    /* 0x030 80087c0c */ void (*Unk11)(void *);
    /* 0x034 80087c10 */ void (*Unk12)(void *);
    /* 0x038 80087c14 */ void (*Unk13)(void *);
    /* 0x03C 80087c18 */ u32 pad;
    /* 0x040 80087c1c */ void (*Unk15)(void *);
    /* 0x044 80087c20 */ void (*Unk16)(void *);
    /* 0x048 80087c24 */ void (*Unk17)(void *);
    /* 0x04C 80087c28 */ void (*Unk18)(void *);
    /* 0x050 80087c2c */ void (*Unk19)(void *);
    /* 0x054 80087c30 */ void (*Unk20)(void *);
    /* 0x058 80087c34 */ void (*Unk21)(void *);
    /* 0x05C 80087c38 */ void (*Unk22)(void *);
    /* 0x060 80087c3c */ void (*Unk23)(void *);
    /* 0x064 80087c40 */ void (*Unk24)(void *);
    /* 0x068 80087c44 */ void (*Unk25)(void *);
    /* 0x06C 80087c48 */ void (*Unk26)(void *);
    /* 0x070 80087c4c */ void (*Unk27)(void *);
    /* 0x074 80087c50 */ void (*Unk28)(void *);
    /* 0x078 80087c54 */ void (*Unk29)(void *);
    /* 0x07C 80087c58 */ void (*Unk30)(void *);
    /* 0x080 80087c5c */ void (*Unk31)(void *);
    /* 0x084 80087c60 */ void (*Unk32)(void *);
    /* 0x088 80087c64 */ void (*Unk33)(void *);
    /* 0x08C 80087c68 */ void (*Unk34)(void *);
    /* 0x090 80087c6c */ void (*Unk35)(void *);
    /* 0x094 80087c70 */ void (*Unk36)(void *);
    /* 0x098 80087c74 */ void (*Unk37)(void *);
    /* 0x09C 80087c78 */ void (*Unk38)(void *);
    /* 0x0A0 80087c7c */ void (*Unk39)(void *);
    /* 0x0A4 80087c80 */ void (*Unk40)(void *);
    /* 0x0A8 80087c84 */ void (*Unk41)(void *);
    /* 0x0AC 80087c88 */ void (*Unk42)(void *);
    /* 0x0B0 80087c8c */ u32 pad2;
    /* 0x0B4 80087c90 */ void (*Unk44)(void *);
    /* 0x0B8 80087c94 */ void (*Unk45)(void *);
    /* 0x0BC 80087c98 */ void (*Unk46)(void *);
    /* 0x0C0 80087c9c */ void (*Unk47)(void *);
    /* 0x0C4 80087ca0 */ void (*Unk48)(void *);
    /* 0x0C8 80087ca4 */ void (*Unk49)(void *);
    /* 0x0CC 80087ca8 */ void (*Unk50)(void *);
    /* 0x0D0 80087cac */ void (*Unk51)(void *);
    /* 0x0D4 80087cb0 */ void (*Unk52)(void *);
    /* 0x0D8 80087cb4 */ void (*Unk53)(void *);
    /* 0x0DC 80087cb8 */ void (*Unk54)(void *);
    /* 0x0E0 80087cbc */ void (*Unk55)(void *);
    /* 0x0E4 80087cc0 */ void (*Unk56)(void *);
    /* 0x0E8 80087cc4 */ void (*Unk57)(void *);
    /* 0x0EC 80087cc8 */ void (*Unk58)(void *);
    /* 0x0F0 80087ccc */ void (*Unk59)(void *, s32, s32);
    /* 0x0F4 80087cd0 */ void (*Unk60)(void *);
    /* 0x0F8 80087cd4 */ void (*Unk61)(void *);
    /* 0x0FC 80087cd8 */ void (*Unk62)(void *);
    /* 0x100 80087cdc */ void (*Unk63)(void *);
    /* 0x104 80087ce0 */ void (*Unk64)(void *);
    /* 0x108 80087ce4 */ void (*Unk65)(void *);
    /* 0x10C 80087ce8 */ void (*Unk66)(void *);
    /* 0x110 80087cec */ void (*Unk67)(void *);
    /* 0x114 80087cf0 */ void (*Unk68)(void *);
    /* 0x118 80087cf4 */ void (*Unk69)(void *);
    /* 0x11C 80087cf8 */ void (*Unk70)(void *);
    /* 0x120 80087cfc */ void (*Unk71)(void *);
    /* 0x124 80087d00 */ void (*Unk72)(void *);
    /* 0x128 80087d04 */ void (*Unk73)(void *);
    /* 0x12C 80087d08 */ void (*Unk74)(void *);
    /* 0x130 80087d0c */ void (*Unk75)(void *);
    /* 0x134 80087d10 */ void (*Unk76)(void *);
    /* 0x138 80087d14 */ void (*Unk77)(void *);
    /* 0x13C 80087d18 */ void (*Unk78)(void *);
    /* 0x140 80087d1c */ void (*Unk79)(void *);
    /* 0x144 80087d20 */ void (*Unk80)(void *);
    /* 0x148 80087d24 */ void (*Unk81)(void *);
    /* 0x14C 80087d28 */ void (*Unk82)(void *);
    /* 0x150 80087d2c */ void (*Unk83)(void *);
    /* 0x154 80087d30 */ void (*Unk84)(void *);
    /* 0x158 80087d34 */ void (*Unk85)(void *);
    /* 0x15C 80087d38 */ void (*Unk86)(void *);
    /* 0x160 80087d3c */ void (*Unk87)(void *);
    /* 0x164 80087d40 */ void (*Unk88)(void *);
    /* 0x168 80087d44 */ void (*Unk89)(void *);
    /* 0x16C 80087d48 */ void (*Unk90)(void *);
    /* 0x170 80087d4c */ void (*Unk91)(void *);
    /* 0x174 80087d50 */ void (*Unk92)(void *);
    /* 0x178 80087d54 */ void (*Unk93)(void *);
    /* 0x17C 80087d58 */ void (*Unk94)(void *);
    /* 0x180 80087d5c */ void (*Unk95)(void *);
    /* 0x184 80087d60 */ void (*Unk96)(void *, s32);
    /* 0x188 80087d64 */ void (*Unk97)(void *, s32);
    /* 0x18C 80087d68 */ void (*Unk98)(void *);
    /* 0x190 80087d6c */ void (*Unk99)(void *);
    /* 0x194 80087d70 */ void (*Unk100)(void *);
    /* 0x198 80087d74 */ void (*Unk101)(void *);
    /* 0x19C 80087d78 */ void (*Unk102)(void *, void *);
    /* 0x1A0 80087d7c */ s32 (*Unk103)(void *, s32);
    /* 0x1A4 80087d80 */ void (*Unk104)(void *);
    /* 0x1A8 80087d84 */ void (*Unk105)(void *);
    /* 0x1AC 80087d88 */ s32 (*Unk106)(void *);
    /* 0x1B0 80087d8c */ void *(*GetRegionCode)(void *, s32 *);  // probably a struct, not region code or anything? TODO name change
    /* 0x1B4 80087d90 */ void (*Unk108)(void *);
    /* 0x1B8 80087d94 */ void (*Unk109)(void *);
    /* 0x1BC 80087d98 */ void (*Unk110)(void *);
    /* 0x1C0 80087d9c */ void (*Unk111)(void *);
    /* 0x1C4 80087da0 */ void (*Unk112)(void *);
    /* 0x1C8 80087da4 */ void (*Unk113)(void *);
    /* 0x1CC 80087da8 */ void (*Unk114)(void *);
    /* 0x1D0 80087dac */ void (*Unk115)(void *);
    /* 0x1D4 80087db0 */ void (*Unk116)(void *);
    /* 0x1D8 80087db4 */ void (*Unk117)(void *);
    /* 0x1DC 80087db8 */ void (*Unk118)(void *);
    /* 0x1E0 80087dbc */ void (*Unk119)(void *);
    /* 0x1E4 80087dc0 */ void (*Unk120)(void *);
    /* 0x1E8 80087dc4 */ void (*Unk121)(void *);
    /* 0x1EC 80087dc8 */ void (*Unk122)(void *);
    /* 0x1F0 80087dcc */ void (*Unk123)(void *);
    /* 0x1F4 80087dd0 */ void (*Unk124)(void *);
    /* 0x1F8 80087dd4 */ void (*Unk125)(void *);
    /* 0x1FC 80087dd8 */ void (*Unk126)(void *);
    /* 0x200 80087ddc */ void (*Unk127)(void *);
    /* 0x204 80087de0 */ void (*Unk128)(void *);
    /* 0x208 80087de4 */ void (*Unk129)(void *);
    /* 0x20C 80087de8 */ void (*Unk130)(void *);
    /* 0x210 80087dec */ void (*Unk131)(void *);
    /* 0x214 80087df0 */ void (*Unk132)(void *);
    /* 0x218 80087df4 */ void (*Unk133)(void *);
    /* 0x21C 80087df8 */ void (*Unk134)(void *);
    /* 0x220 80087dfc */ void (*Unk135)(void *);
    /* 0x224 80087e00 */ void (*Unk136)(void *);
    /* 0x228 80087e04 */ void (*Unk137)(void *, u32);
} dream_sys_vtable_t;

typedef struct dream_sys {
    /* 0x00 */ dream_sys_vtable_t *vtable;
    /* 0x04 */ s32 m_Unk0;
    /* 0x08 */ s32 m_Unk1;
    /* 0x0C */ s32 m_Unk2;
    /* 0x10 */ s32 m_Unk3;
    /* 0x14 */ s32 m_Unk4;
    /* 0x18 */ s32 m_Unk5;
    /* 0x1C */ s32 m_Unk6;
    /* 0x20 */ s32 m_Unk7;
    /* 0x24 */ s32 m_GameTick;
    /* 0x28 */ s32 m_Unk9;
    /* 0x2C */ s32 m_Unk10;
    /* 0x30 */ s32 m_Unk11;
    /* 0x34 */ s32 m_Unk12;
    /* 0x38 */ s32 m_Unk13;
    /* 0x3C */ s32 m_Unk14;
    /* 0x40 */ s32 m_Unk15;
    /* 0x44 */ s32 m_Unk16;
    /* 0x48 */ s32 m_Unk17;
    /* 0x4C */ s32 m_Unk18;
    /* 0x50 */ s32 m_Unk19;
    /* 0x54 */ s32 m_Unk20;
    /* 0x58 */ s32 m_Unk21;
    /* 0x5C */ s32 m_Unk22;
    /* 0x60 */ s32 m_Unk23;
    /* 0x64 */ s32 m_Unk24;
    /* 0x68 */ s32 m_Unk25;
    /* 0x6C */ s32 m_Unk26;
    /* 0x70 */ s32 m_Unk27;
    /* 0x74 */ s32 m_Unk28;
    /* 0x78 */ s32 m_Unk29;
    /* 0x7C */ s32 m_Unk30;
    /* 0x80 */ s32 m_Unk31;
    /* 0x84 */ s32 m_Unk32;
    /* 0x88 */ s32 m_LookUpDownState;
    /* 0x8C */ s32 m_LookVerticalPosition;
    /* 0x90 */ s32 m_Unk35;
    /* 0x94 */ s32 m_Unk36;
    /* 0x98 */ s32 m_Unk37;
    /* 0x9C */ s32 m_Unk38;
    /* 0xA0 */ dream_sys_move_state_t m_MoveState;
    /* 0xA4 */ s32 m_LeftRightState; // 1 = Currently turning left, 2 = turning right
    /* 0xA8 */ s32 m_Unk41;
    /* 0xAC */ s32 m_Unk42;
    /* 0xB0 */ s32 m_Unk43;
    /* 0xB4 */ s32 m_Unk44;
    /* 0xB8 */ s32 m_FloorSurfaceType;
    /* 0xBC */ s32 m_Unk46;
    /* 0xC0 */ s32 m_Unk47;
    /* 0xC4 */ s32 m_Unk48;
    /* 0xC8 */ s32 m_Unk49;
    /* 0xCC */ s32 m_Unk50;
    /* 0xD0 */ s32 m_Unk51;
    /* 0xD4 */ s32 m_Unk52;
    /* 0xD8 */ s32 m_Unk53;
    /* 0xDC */ s32 m_Unk54;
    /* 0xE0 */ s32 m_Unk55;
    /* 0xE4 */ s32 m_Unk56;
    /* 0xE8 */ s32 m_Unk57;
    /* 0xEC */ s32 m_Unk58;
    /* 0xF0 */ s32 m_Unk59;
    /* 0xF4 */ s32 m_Unk60;
    /* 0xF8 */ s32 m_Unk61;
    /* 0xFC */ s32 m_Unk62;
    /* 0x100 */ s32 m_Unk63;
    /* 0x104 */ s32 m_Unk64;
    /* 0x108 */ s32 m_Unk65;
    /* 0x10C */ s32 m_Unk66;
    /* 0x110 */ s32 m_Unk67;
    /* 0x114 */ s32 m_Unk68;
    /* 0x118 */ s32 m_Unk69;
    /* 0x11C */ s32 m_Unk70;
    /* 0x120 */ s32 m_Unk71;
    /* 0x124 */ s32 m_Unk72;
    /* 0x128 */ s32 m_Unk73;
    /* 0x12C */ s32 m_Unk74;
    /* 0x130 */ s32 m_Unk75;
    /* 0x134 */ s32 m_Unk76;
    /* 0x138 */ s32 m_Unk77;
    /* 0x13C */ s32 m_Unk78;
    /* 0x140 */ s32 m_Unk79;
    /* 0x144 */ s32 m_Unk80;
    /* 0x148 */ s32 m_Unk81;
    /* 0x14C */ s32 m_Unk82;
    /* 0x150 */ s32 m_Unk83;
    /* 0x154 */ s32 m_Unk84;
    /* 0x158 */ s32 m_Unk85;
    /* 0x15C */ s32 m_Unk86;
    /* 0x160 */ s32 m_Unk87;
    /* 0x164 */ s32 m_NextMap;
    /* 0x168 */ s32 m_Unk89;
    /* 0x16C */ s32 m_Unk90;
    /* 0x170 */ s32 m_Unk91;
    /* 0x174 */ s32 m_Unk92;
    /* 0x178 */ s32 m_Unk93;
    /* 0x17C */ s32 m_Unk94;
    /* 0x180 */ s32 m_Unk95;
    /* 0x184 */ s32 m_Unk96;
    /* 0x188 */ s32 m_Unk97;
    /* 0x18C */ s32 m_Unk98;
    /* 0x190 */ s32 m_Unk99;
    /* 0x194 */ s32 m_Unk100;
    /* 0x198 */ s32 m_Unk101;
    /* 0x19C */ s32 m_Unk102;
    /* 0x1A0 */ s32 m_Unk103;
    /* 0x1A4 */ s32 m_Unk104;
    /* 0x1A8 */ s32 m_Unk105;
    /* 0x1AC */ s32 m_Unk106;
    /* 0x1B0 */ s32 m_Unk107;
    /* 0x1B4 */ s32 m_Unk108;
    /* 0x1B8 */ s32 m_Unk109;
    /* 0x1BC */ s32 m_Unk110;
    /* 0x1C0 */ s32 m_Unk111;
    /* 0x1C4 */ s32 m_Unk112;
    /* 0x1C8 */ s32 m_Unk113;
    /* 0x1CC */ s32 m_Unk114;
    /* 0x1D0 */ s32 m_Unk115;
    /* 0x1D4 */ s32 m_Unk116;
    /* 0x1D8 */ s32 m_Unk117;
    /* 0x1DC */ s32 m_Unk118;
    /* 0x1E0 */ s32 m_Unk119;
    /* 0x1E4 */ s32 m_Unk120;
    /* 0x1E8 */ s32 m_Unk121;
    /* 0x1EC */ s32 m_Unk122;
    /* 0x1F0 */ s32 m_Unk123;
    /* 0x1F4 */ s32 m_Unk124;
    /* 0x1F8 */ s32 m_Unk125;
    /* 0x1FC */ s32 m_Unk126;
    /* 0x200 */ s32 m_Unk127;
    /* 0x204 */ s32 m_Unk128;
    /* 0x208 */ s32 m_Unk129;
    /* 0x20C */ s32 m_Unk130;
    /* 0x210 */ s32 m_Unk131;
    /* 0x214 */ s32 m_Unk132;
    /* 0x218 */ s32 m_Unk133;
    /* 0x21C */ s32 m_Unk134;
    /* 0x220 */ s32 m_Unk135;
    /* 0x224 */ s32 m_Unk136;
    /* 0x228 */ s32 m_Unk137;
    /* 0x22C */ s32 m_Unk138;
    /* 0x230 */ s32 m_Unk139;
    /* 0x234 */ s32 m_Unk140;
    /* 0x238 */ s32 m_Unk141;
    /* 0x23C */ s32 m_Unk142;
    /* 0x240 */ s32 m_Unk143;
    /* 0x244 */ s32 m_Unk144;
    /* 0x248 */ s32 m_Unk145;
    /* 0x24C */ s32 m_Unk146;
    /* 0x250 */ s32 m_Unk147;
    /* 0x254 */ s32 m_Unk148;
    /* 0x258 */ s32 m_Unk149;
    /* 0x25C */ s32 m_Unk150;
    /* 0x260 */ s32 m_Unk151;
    /* 0x264 */ s32 m_Unk152;
    /* 0x268 */ s32 m_Unk153;
    /* 0x26C */ s32 m_Unk154;
    /* 0x270 */ s32 m_Unk155;
    /* 0x274 */ s32 m_Unk156;
    /* 0x278 */ s32 m_Unk157;
    /* 0x27C */ s32 m_Unk158;
    /* 0x280 */ s32 m_Unk159;
    /* 0x284 */ s32 m_Unk160;
    /* 0x288 */ s32 m_Unk161;
    /* 0x28C */ s32 m_Unk162;
    /* 0x290 */ s32 m_Unk163;
    /* 0x294 */ s32 m_Unk164;
    /* 0x298 */ s32 m_Unk165;
    /* 0x29C */ s32 m_Unk166;
    /* 0x2A0 */ s32 m_Unk167;
    /* 0x2A4 */ s32 m_Unk168;
    /* 0x2A8 */ s32 m_Unk169;
    /* 0x2AC */ s32 m_Unk170;
    /* 0x2B0 */ s32 m_Unk171;
    /* 0x2B4 */ s32 m_Unk172;
    /* 0x2B8 */ s32 m_Unk173;
    /* 0x2BC */ s32 m_Unk174;
    /* 0x2C0 */ s32 m_Unk175;
    /* 0x2C4 */ s32 m_Unk176;
    /* 0x2C8 */ s32 m_Unk177;
    /* 0x2CC */ s32 m_Unk178;
    /* 0x2D0 */ s32 m_Unk179;
    /* 0x2D4 */ s32 m_Unk180;
    /* 0x2D8 */ s32 m_Unk181;
    /* 0x2DC */ s32 m_Unk182;
    /* 0x2E0 */ s32 m_Unk183;
    /* 0x2E4 */ s32 m_Unk184;
    /* 0x2E8 */ s32 m_Unk185;
    /* 0x2EC */ s32 m_Unk186;
    /* 0x2F0 */ s32 m_Unk187;
    /* 0x2F4 */ s32 m_Unk188;
    /* 0x2F8 */ s32 m_Unk189;
    /* 0x2FC */ s32 m_Unk190;
    /* 0x300 */ s32 m_Unk191;
    /* 0x304 */ s32 m_Unk192;
    /* 0x308 */ s32 m_Unk193;
    /* 0x30C */ s32 m_Unk194;
    /* 0x310 */ s32 m_Unk195;
    /* 0x314 */ s32 m_Unk196;
    /* 0x318 */ s32 m_Unk197;
    /* 0x31C */ s32 m_Unk198;
    /* 0x320 */ s32 m_Unk199;
    /* 0x324 */ s32 m_Unk200;
    /* 0x328 */ s32 m_Unk201;
    /* 0x32C */ s32 m_Unk202;
    /* 0x330 */ s32 m_Unk203;
    /* 0x334 */ s32 m_Unk204;
    /* 0x338 */ s32 m_Unk205;
    /* 0x33C */ s32 m_Unk206;
    /* 0x340 */ s32 m_Unk207;
    /* 0x344 */ s32 m_Unk208;
    /* 0x348 */ s32 m_Unk209;
    /* 0x34C */ s32 m_Unk210;
    /* 0x350 */ s32 m_Unk211;
    /* 0x354 */ s32 m_Unk212;
    /* 0x358 */ s32 m_Unk213;
    /* 0x35C */ s32 m_Unk214;
    /* 0x360 */ s32 m_Unk215;
    /* 0x364 */ s32 m_Unk216;
    /* 0x368 */ s32 m_Unk217;
    /* 0x36C */ s32 m_Unk218;
    /* 0x370 */ s32 m_Unk219;
    /* 0x374 */ s32 m_Unk220;
    /* 0x378 */ s32 m_Unk221;
    /* 0x37C */ s32 m_Unk222;
    /* 0x380 */ s32 m_Unk223;
    /* 0x384 */ s32 m_Unk224;
    /* 0x388 */ s32 m_Unk225;
    /* 0x38C */ s32 m_Unk226;
    /* 0x390 */ s32 m_Unk227;
    /* 0x394 */ s32 m_Unk228;
    /* 0x398 */ s32 m_Unk229;
    /* 0x39C */ s32 m_Unk230;
    /* 0x3A0 */ s32 m_Unk231;
    /* 0x3A4 */ s32 m_Unk232;
    /* 0x3A8 */ s32 m_Unk233;
    /* 0x3AC */ s32 m_Unk234;
    /* 0x3B0 */ s32 m_Unk235;
    /* 0x3B4 */ s32 m_Unk236;
    /* 0x3B8 */ s32 m_Unk237;
    /* 0x3BC */ s32 m_Unk238;
    /* 0x3C0 */ s32 m_Unk239;
    /* 0x3C4 */ s32 m_Unk240;
    /* 0x3C8 */ s32 m_Unk241;
    /* 0x3CC */ s32 m_Unk242;
    /* 0x3D0 */ s32 m_Unk243;
    /* 0x3D4 */ s32 m_Unk244;
    /* 0x3D8 */ s32 m_Unk245;
    /* 0x3DC */ s32 m_Unk246;
    /* 0x3E0 */ s32 m_Unk247;
    /* 0x3E4 */ s32 m_Unk248;
    /* 0x3E8 */ s32 m_Unk249;
    /* 0x3EC */ s32 m_Unk250;
    /* 0x3F0 */ s32 m_Unk251;
    /* 0x3F4 */ s32 m_Unk252;
    /* 0x3F8 */ s32 m_Unk253;
    /* 0x3FC */ s32 m_Unk254;
    /* 0x400 */ s32 m_Unk255;
    /* 0x404 */ s32 m_Unk256;
    /* 0x408 */ s32 m_Unk257;
    /* 0x40C */ s32 m_Unk258;
    /* 0x410 */ s32 m_Unk259;
    /* 0x414 */ s32 m_Unk260;
    /* 0x418 */ s32 m_Unk261;
    /* 0x41C */ s32 m_Unk262;
    /* 0x420 */ s32 m_Unk263;
    /* 0x424 */ s32 m_Unk264;
    /* 0x428 */ s32 m_Unk265;
    /* 0x42C */ s32 m_Unk266;
    /* 0x430 */ s32 m_Unk267;
    /* 0x434 */ s32 m_Unk268;
    /* 0x438 */ s32 m_Unk269;
    /* 0x43C */ s32 m_Unk270;
    /* 0x440 */ s32 m_Unk271;
    /* 0x444 */ s32 m_Unk272;
    /* 0x448 */ s32 m_Unk273;
    /* 0x44C */ s32 m_Unk274;
    /* 0x450 */ s32 m_Unk275;
    /* 0x454 */ s32 m_Unk276;
    /* 0x458 */ s32 m_Unk277;
    /* 0x45C */ s32 m_Unk278;
    /* 0x460 */ s32 m_Unk279;
    /* 0x464 */ s32 m_Unk280;
    /* 0x468 */ s32 m_Unk281;
    /* 0x46C */ s32 m_Unk282;
    /* 0x470 */ s32 m_Unk283;
    /* 0x474 */ s32 m_Unk284;
    /* 0x478 */ s32 m_Unk285;
    /* 0x47C */ s32 m_Unk286;
    /* 0x480 */ s32 m_Unk287;
    /* 0x484 */ s32 m_Unk288;
    /* 0x488 */ s32 m_Unk289;
    /* 0x48C */ s32 m_Unk290;
    /* 0x490 */ s32 m_Unk291;
    /* 0x494 */ s32 m_Unk292;
    /* 0x498 */ s32 m_Unk293;
    /* 0x49C */ s32 m_Unk294;
    /* 0x4A0 */ s32 m_Unk295;
    /* 0x4A4 */ s32 m_Unk296;
    /* 0x4A8 */ s32 m_Unk297;
    /* 0x4AC */ s32 m_Unk298;
    /* 0x4B0 */ s32 m_Unk299;
    /* 0x4B4 */ s32 m_Unk300;
    /* 0x4B8 */ s32 m_Unk301;
    /* 0x4BC */ s32 m_Unk302;
    /* 0x4C0 */ s32 m_Unk303;
    /* 0x4C4 */ s32 m_Unk304;
    /* 0x4C8 */ s32 m_Unk305;
    /* 0x4CC */ s32 m_Unk306;
    /* 0x4D0 */ s32 m_Unk307;
    /* 0x4D4 */ s32 m_Unk308;
    /* 0x4D8 */ s32 m_Unk309;
    /* 0x4DC */ s32 m_Unk310;
    /* 0x4E0 */ s32 m_Unk311;
    /* 0x4E4 */ s32 m_Unk312;
    /* 0x4E8 */ s32 m_Unk313;
    /* 0x4EC */ s32 m_Unk314;
    /* 0x4F0 */ s32 m_Unk315;
    /* 0x4F4 */ s32 m_Unk316;
    /* 0x4F8 */ s32 m_Unk317;
    /* 0x4FC */ s32 m_Unk318;
    /* 0x500 */ s32 m_Unk319;
    /* 0x504 */ s32 m_Unk320;
    /* 0x508 */ s32 m_Unk321;
    /* 0x50C */ s32 m_Unk322;
    /* 0x510 */ s32 m_Unk323;
    /* 0x514 */ s32 m_Unk324;
    /* 0x518 */ s32 m_Unk325;
    /* 0x51C */ s32 m_Unk326;
    /* 0x520 */ s32 m_Unk327;
    /* 0x524 */ s32 m_Unk328;
    /* 0x528 */ s32 m_Unk329;
    /* 0x52C */ s32 m_Unk330;
    /* 0x530 */ s32 m_Unk331;
    /* 0x534 */ s32 m_Unk332;
    /* 0x538 */ s32 m_Unk333;
    /* 0x53C */ s32 m_Unk334;
    /* 0x540 */ s32 m_Unk335;
    /* 0x544 */ s32 m_Unk336;
    /* 0x548 */ s32 m_Unk337;
    /* 0x54C */ s32 m_Unk338;
    /* 0x550 */ s32 m_Unk339;
    /* 0x554 */ s32 m_Unk340;
    /* 0x558 */ s32 m_Unk341;
    /* 0x55C */ s32 m_Unk342;
    /* 0x560 */ s32 m_Unk343;
    /* 0x564 */ s32 m_Unk344;
    /* 0x568 */ s32 m_Unk345;
    /* 0x56C */ s32 m_Unk346;
    /* 0x570 */ s32 m_Unk347;
    /* 0x574 */ s32 m_Unk348;
    /* 0x578 */ s32 m_Unk349;
    /* 0x57C */ s32 m_Unk350;
    /* 0x580 */ s32 m_Unk351;
    /* 0x584 */ s32 m_Unk352;
    /* 0x588 */ s32 m_Unk353;
    /* 0x58C */ s32 m_Unk354;
    /* 0x590 */ s32 m_Unk355;
    /* 0x594 */ s32 m_Unk356;
    /* 0x598 */ s32 m_Unk357;
    /* 0x59C */ s32 m_Unk358;
    /* 0x5A0 */ s32 m_Unk359;
    /* 0x5A4 */ s32 m_Unk360;
    /* 0x5A8 */ s32 m_Unk361;
    /* 0x5AC */ s32 m_Unk362;
    /* 0x5B0 */ s32 m_Unk363;
    /* 0x5B4 */ s32 m_Unk364;
    /* 0x5B8 */ s32 m_Unk365;
    /* 0x5BC */ s32 m_Unk366;
    /* 0x5C0 */ s32 m_Unk367;
    /* 0x5C4 */ s32 m_Unk368;
    /* 0x5C8 */ s32 m_Unk369;
    /* 0x5CC */ s32 m_Unk370;
    /* 0x5D0 */ s32 m_Unk371;
    /* 0x5D4 */ s32 m_Unk372;
    /* 0x5D8 */ s32 m_Unk373;
    /* 0x5DC */ s32 m_Unk374;
    /* 0x5E0 */ s32 m_Unk375;
    /* 0x5E4 */ s32 m_Unk376;
    /* 0x5E8 */ s32 m_Unk377;
    /* 0x5EC */ s32 m_Unk378;
    /* 0x5F0 */ s32 m_Unk379;
    /* 0x5F4 */ s32 m_Unk380;
    /* 0x5F8 */ s32 m_Unk381;
    /* 0x5FC */ s32 m_Unk382;
    /* 0x600 */ s32 m_Unk383;
    /* 0x604 */ s32 m_Unk384;
    /* 0x608 */ s32 m_Unk385;
    /* 0x60C */ s32 m_Unk386;
    /* 0x610 */ s32 m_Unk387;
    /* 0x614 */ s32 m_Unk388;
    /* 0x618 */ s32 m_Unk389;
    /* 0x61C */ s32 m_Unk390;
    /* 0x620 */ s32 m_Unk391;
    /* 0x624 */ s32 m_Unk392;
    /* 0x628 */ s32 m_Unk393;
    /* 0x62C */ s32 m_Unk394;
    /* 0x630 */ s32 m_Unk395;
    /* 0x634 */ s32 m_Unk396;
    /* 0x638 */ s32 m_Unk397;
    /* 0x63C */ s32 m_Unk398;
    /* 0x640 */ s32 m_Unk399;
    /* 0x644 */ s32 m_Unk400;
    /* 0x648 */ s32 m_Unk401;
    /* 0x64C */ s32 m_Unk402;
    /* 0x650 */ s32 m_Unk403;
    /* 0x654 */ s32 m_Unk404;
    /* 0x658 */ s32 m_Unk405;
    /* 0x65C */ s32 m_Unk406;
    /* 0x660 */ s32 m_Unk407;
    /* 0x664 */ s32 m_Unk408;
    /* 0x668 */ s32 m_Unk409;
    /* 0x66C */ s32 m_Unk410;
    /* 0x670 */ s32 m_Unk411;
    /* 0x674 */ s32 m_Unk412;
    /* 0x678 */ s32 m_Unk413;
    /* 0x67C */ s32 m_Unk414;
    /* 0x680 */ s32 m_Unk415;
    /* 0x684 */ s32 m_Unk416;
    /* 0x688 */ s32 m_Unk417;
    /* 0x68C */ s32 m_Unk418;
    /* 0x690 */ s32 m_Unk419;
    /* 0x694 */ s32 m_Unk420;
    /* 0x698 */ s32 m_Unk421;
    /* 0x69C */ s32 m_Unk422;
    /* 0x6A0 */ s32 m_Unk423;
    /* 0x6A4 */ s32 m_Unk424;
    /* 0x6A8 */ s32 m_Unk425;
    /* 0x6AC */ s32 m_Unk426;
    /* 0x6B0 */ s32 m_Unk427;
    /* 0x6B4 */ s32 m_Unk428;
    /* 0x6B8 */ s32 m_Unk429;
    /* 0x6BC */ s32 m_Unk430;
    /* 0x6C0 */ s32 m_Unk431;
    /* 0x6C4 */ s32 m_Unk432;
    /* 0x6C8 */ s32 m_Unk433;
    /* 0x6CC */ s32 m_Unk434;
    /* 0x6D0 */ s32 m_Unk435;
    /* 0x6D4 */ s32 m_Unk436;
    /* 0x6D8 */ s32 m_Unk437;
    /* 0x6DC */ s32 m_Unk438;
    /* 0x6E0 */ s32 m_Unk439;
    /* 0x6E4 */ s32 m_Unk440;
    /* 0x6E8 */ s32 m_Unk441;
    /* 0x6EC */ s32 m_Unk442;
    /* 0x6F0 */ s32 m_Unk443;
    /* 0x6F4 */ s32 m_Unk444;
    /* 0x6F8 */ s32 m_Unk445;
    /* 0x6FC */ s32 m_Unk446;
    /* 0x700 */ s32 m_Unk447;
    /* 0x704 */ s32 m_Unk448;
    /* 0x708 */ s32 m_Unk449;
    /* 0x70C */ s32 m_Unk450;
    /* 0x710 */ s32 m_Unk451;
    /* 0x714 */ s32 m_Unk452;
    /* 0x718 */ s32 m_Unk453;
    /* 0x71C */ s32 m_Unk454;
    /* 0x720 */ s32 m_Unk455;
    /* 0x724 */ s32 m_Unk456;
    /* 0x728 */ s32 m_Unk457;
    /* 0x72C */ s32 m_Unk458;
    /* 0x730 */ s32 m_Unk459;
    /* 0x734 */ s32 m_Unk460;
    /* 0x738 */ s32 m_Unk461;
    /* 0x73C */ s32 m_Unk462;
    /* 0x740 */ s32 m_Unk463;
    /* 0x744 */ s32 m_Unk464;
    /* 0x748 */ s32 m_Unk465;
    /* 0x74C */ s32 m_Unk466;
    /* 0x750 */ s32 m_Unk467;
    /* 0x754 */ s32 m_Unk468;
    /* 0x758 */ s32 m_Unk469;
    /* 0x75C */ s32 m_Unk470;
    /* 0x760 */ s32 m_Unk471;
    /* 0x764 */ s32 m_Unk472;
    /* 0x768 */ s32 m_Unk473;
    /* 0x76C */ s32 m_Unk474;
    /* 0x770 */ s32 m_Unk475;
    /* 0x774 */ s32 m_Unk476;
    /* 0x778 */ s32 m_Unk477;
    /* 0x77C */ s32 m_Unk478;
    /* 0x780 */ s32 m_Unk479;
    /* 0x784 */ s32 m_Unk480;
    /* 0x788 */ s32 m_Unk481;
    /* 0x78C */ s32 m_Unk482;
    /* 0x790 */ s32 m_Unk483;
    /* 0x794 */ s32 m_Unk484;
    /* 0x798 */ s32 m_Unk485;
    /* 0x79C */ s32 m_Unk486;
    /* 0x7A0 */ s32 m_Unk487;
    /* 0x7A4 */ s32 m_Unk488;
    /* 0x7A8 */ s32 m_Unk489;
    /* 0x7AC */ s32 m_Unk490;
    /* 0x7B0 */ s32 m_Unk491;
    /* 0x7B4 */ s32 m_Unk492;
    /* 0x7B8 */ s32 m_Unk493;
    /* 0x7BC */ s32 m_Unk494;
    /* 0x7C0 */ s32 m_Unk495;
    /* 0x7C4 */ s32 m_Unk496;
    /* 0x7C8 */ s32 m_Unk497;
    /* 0x7CC */ s32 m_Unk498;
    /* 0x7D0 */ s32 m_Unk499;
    /* 0x7D4 */ s32 m_Unk500;
    /* 0x7D8 */ s32 m_Unk501;
    /* 0x7DC */ s32 m_Unk502;
    /* 0x7E0 */ s32 m_Unk503;
    /* 0x7E4 */ s32 m_Unk504;
    /* 0x7E8 */ s32 m_Unk505;
    /* 0x7EC */ s32 m_Unk506;
    /* 0x7F0 */ s32 m_Unk507;
    /* 0x7F4 */ s32 m_Unk508;
    /* 0x7F8 */ s32 m_Unk509;
    /* 0x7FC */ s32 m_Unk510;
    /* 0x800 */ s32 m_Unk511;
    /* 0x804 */ s32 m_Unk512;
    /* 0x808 */ s32 m_Unk513;
    /* 0x80C */ s32 m_Unk514;
    /* 0x810 */ s32 m_Unk515;
    /* 0x814 */ s32 m_Unk516;
    /* 0x818 */ s32 m_Unk517;
    /* 0x81C */ s32 m_Unk518;
    /* 0x820 */ s32 m_Unk519;
    /* 0x824 */ s32 m_Unk520;
    /* 0x828 */ s32 m_Unk521;
    /* 0x82C */ s32 m_Unk522;
    /* 0x830 */ s32 m_Unk523;
    /* 0x834 */ s32 m_Unk524;
    /* 0x838 */ s32 m_Unk525;
    /* 0x83C */ s32 m_Unk526;
    /* 0x840 */ s32 m_Unk527;
    /* 0x844 */ s32 m_Unk528;
    /* 0x848 */ s32 m_Unk529;
    /* 0x84C */ s32 m_Unk530;
    /* 0x850 */ s32 m_Unk531;
    /* 0x854 */ s32 m_Unk532;
    /* 0x858 */ s32 m_Unk533;
    /* 0x85C */ s32 m_Unk534;
    /* 0x860 */ s32 m_Unk535;
    /* 0x864 */ s32 m_Unk536;
    /* 0x868 */ s32 m_Unk537;
    /* 0x86C */ s32 m_Unk538;
    /* 0x870 */ s32 m_Unk539;
    /* 0x874 */ s32 m_Unk540;
    /* 0x878 */ s32 m_Unk541;
    /* 0x87C */ s32 m_Unk542;
    /* 0x880 */ s32 m_Unk543;
    /* 0x884 */ s32 m_Unk544;
    /* 0x888 */ s32 m_Unk545;
    /* 0x88C */ s32 m_Unk546;
    /* 0x890 */ s32 m_Unk547;
    /* 0x894 */ s32 m_Unk548;
    /* 0x898 */ s32 m_Unk549;
    /* 0x89C */ s32 m_Unk550;
    /* 0x8A0 */ s32 m_Unk551;
    /* 0x8A4 */ s32 m_Unk552;
    /* 0x8A8 */ s32 m_Unk553;
    /* 0x8AC */ s32 m_Unk554;
    /* 0x8B0 */ s32 m_Unk555;
    /* 0x8B4 */ s32 m_Unk556;
    /* 0x8B8 */ s32 m_Unk557;
    /* 0x8BC */ s32 m_Unk558;
    /* 0x8C0 */ s32 m_Unk559;
    /* 0x8C4 */ s32 m_Unk560;
    /* 0x8C8 */ s32 m_Unk561;
    /* 0x8CC */ s32 m_Unk562;
    /* 0x8D0 */ s32 m_Unk563;
    /* 0x8D4 */ s32 m_Unk564;
    /* 0x8D8 */ s32 m_Unk565;
    /* 0x8DC */ s32 m_Unk566;
    /* 0x8E0 */ s32 m_Unk567;
    /* 0x8E4 */ s32 m_Unk568;
    /* 0x8E8 */ s32 m_Unk569;
    /* 0x8EC */ s32 m_Unk570;
    /* 0x8F0 */ s32 m_Unk571;
    /* 0x8F4 */ s32 m_Unk572;
    /* 0x8F8 */ s32 m_Unk573;
    /* 0x8FC */ s32 m_Unk574;
    /* 0x900 */ s32 m_Unk575;
    /* 0x904 */ s32 m_Unk576;
    /* 0x908 */ s32 m_Unk577;
    /* 0x90C */ s32 m_Unk578;
    /* 0x910 */ s32 m_Unk579;
    /* 0x914 */ s32 m_Unk580;
    /* 0x918 */ s32 m_Unk581;
    /* 0x91C */ s32 m_Unk582;
    /* 0x920 */ s32 m_Unk583;
    /* 0x924 */ s32 m_Unk584;
    /* 0x928 */ s32 m_Unk585;
} dream_sys_t;

#endif