#ifndef LSD_ENTITY_H
#define LSD_ENTITY_H

#include "305B0.h"
#include "common.h"

typedef struct entity entity_t;

typedef struct entity_vtable {
    /* 0x000 80089ad4 */ u32 value;
    /* 0x004 80089ad8 */ void (*Destroy)(entity_t *);
    /* 0x008 80089adc */ void *(*Construct)(entity_t *, s32, s32, s32);
    /* 0x00C 80089ae0 */ void (*Cleanup)(entity_t *);
    /* 0x010 80089ae4 */ void (*Unk3)(entity_t *);
    /* 0x014 80089ae8 */ void (*Unk4)(entity_t *);
    /* 0x018 80089aec */ void (*Unk5)(entity_t *);
    /* 0x01C 80089af0 */ void (*Unk6)(entity_t *);
    /* 0x020 80089af4 */ void (*Unk7)(entity_t *);
    /* 0x024 80089af8 */ void (*Unk8)(entity_t *);
    /* 0x028 80089afc */ void (*Unk9)(entity_t *);
    /* 0x02C 80089b00 */ void (*Unk10)(entity_t *);
    /* 0x030 80089b04 */ void (*Unk11)(entity_t *, s32);
    /* 0x034 80089b08 */ void (*Unk12)(entity_t *);
    /* 0x038 80089b0c */ void (*Unk13)(entity_t *);
    /* 0x03C 80089b10 */ s32 dummy1;
    /* 0x040 80089b14 */ void (*Unk15)(entity_t *);
    /* 0x044 80089b18 */ void (*Unk16)(entity_t *);
    /* 0x048 80089b1c */ void (*Unk17)(entity_t *);
    /* 0x04C 80089b20 */ void (*Unk18)(entity_t *);
    /* 0x050 80089b24 */ void (*Unk19)(entity_t *);
    /* 0x054 80089b28 */ void (*Unk20)(entity_t *);
    /* 0x058 80089b2c */ void (*Unk21)(entity_t *);
    /* 0x05C 80089b30 */ void (*Unk22)(entity_t *);
    /* 0x060 80089b34 */ void (*Unk23)(entity_t *, s32);
    /* 0x064 80089b38 */ void (*Unk24)(entity_t *);
    /* 0x068 80089b3c */ void (*Unk25)(entity_t *);
    /* 0x06C 80089b40 */ void (*Unk26)(entity_t *);
    /* 0x070 80089b44 */ void (*Unk27)(entity_t *, s32);
    /* 0x074 80089b48 */ void (*Unk28)(entity_t *);
    /* 0x078 80089b4c */ void (*Unk29)(entity_t *);
    /* 0x07C 80089b50 */ void (*Unk30)(entity_t *);
    /* 0x080 80089b54 */ void (*Unk31)(entity_t *);
    /* 0x084 80089b58 */ void (*Unk32)(entity_t *);
    /* 0x088 80089b5c */ void (*Unk33)(entity_t *);
    /* 0x08C 80089b60 */ void (*Unk34)(entity_t *);
    /* 0x090 80089b64 */ void (*Unk35)(entity_t *);
    /* 0x094 80089b68 */ void (*Unk36)(entity_t *);
    /* 0x098 80089b6c */ void (*Unk37)(entity_t *);
    /* 0x09C 80089b70 */ void (*Unk38)(entity_t *);
    /* 0x0A0 80089b74 */ void (*Unk39)(entity_t *);
    /* 0x0A4 80089b78 */ void (*Unk40)(entity_t *);
    /* 0x0A8 80089b7c */ void (*Unk41)(entity_t *);
    /* 0x0AC 80089b80 */ void (*Unk42)(entity_t *);
    /* 0x0B0 80089b84 */ s32 dummy2;
    /* 0x0B4 80089b88 */ void (*Unk44)(entity_t *);
    /* 0x0B8 80089b8c */ void (*Unk45)(entity_t *);
    /* 0x0BC 80089b90 */ void (*Unk46)(entity_t *);
    /* 0x0C0 80089b94 */ void (*Unk47)(entity_t *);
    /* 0x0C4 80089b98 */ void (*Unk48)(entity_t *);
    /* 0x0C8 80089b9c */ void (*Unk49)(entity_t *);
    /* 0x0CC 80089ba0 */ void (*Unk50)(entity_t *);
    /* 0x0D0 80089ba4 */ void (*Unk51)(entity_t *);
    /* 0x0D4 80089ba8 */ void (*Unk52)(entity_t *);
    /* 0x0D8 80089bac */ void (*Unk53)(entity_t *);
    /* 0x0DC 80089bb0 */ void (*Unk54)(entity_t *);
    /* 0x0E0 80089bb4 */ void (*Unk55)(entity_t *);
    /* 0x0E4 80089bb8 */ void (*Unk56)(entity_t *);
    /* 0x0E8 80089bbc */ void (*Unk57)(entity_t *);
    /* 0x0EC 80089bc0 */ void (*Unk58)(entity_t *);
    /* 0x0F0 80089bc4 */ void (*Unk59)(entity_t *);
    /* 0x0F4 80089bc8 */ void (*Unk60)(entity_t *);
    /* 0x0F8 80089bcc */ void (*Unk61)(entity_t *);
    /* 0x0FC 80089bd0 */ void (*Unk62)(entity_t *);
    /* 0x100 80089bd4 */ void (*Unk63)(entity_t *);
    /* 0x104 80089bd8 */ void (*Unk64)(entity_t *);
    /* 0x108 80089bdc */ void (*Unk65)(entity_t *);
    /* 0x10C 80089be0 */ void (*Unk66)(entity_t *, s32);
    /* 0x110 80089be4 */ void (*Unk67)(entity_t *);
    /* 0x114 80089be8 */ void (*Unk68)(entity_t *);
    /* 0x118 80089bec */ void (*Unk69)(entity_t *);
    /* 0x11C 80089bf0 */ void (*Unk70)(entity_t *);
    /* 0x120 80089bf4 */ void (*Unk71)(entity_t *);
    /* 0x124 80089bf8 */ void (*Unk72)(entity_t *);
    /* 0x128 80089bfc */ void (*Unk73)(entity_t *);
    /* 0x12C 80089c00 */ void (*Unk74)(entity_t *);
    /* 0x130 80089c04 */ void (*Unk75)(entity_t *);
    /* 0x134 80089c08 */ void (*Unk76)(entity_t *);
    /* 0x138 80089c0c */ void (*Unk77)(entity_t *);
    /* 0x13C 80089c10 */ void (*Unk78)(entity_t *);
    /* 0x140 80089c14 */ void (*Unk79)(entity_t *);
    /* 0x144 80089c18 */ s32 (*Unk80)(entity_t *, s32);
    /* 0x148 80089c1c */ void (*Unk81)(entity_t *);
    /* 0x14C 80089c20 */ void (*Unk82)(entity_t *);
    /* 0x150 80089c24 */ void (*Unk83)(entity_t *);
    /* 0x154 80089c28 */ void (*Unk84)(entity_t *);
    /* 0x158 80089c2c */ void (*Unk85)(entity_t *);
    /* 0x15C 80089c30 */ void (*Unk86)(entity_t *);
    /* 0x160 80089c34 */ void (*Unk87)(entity_t *);
    /* 0x164 80089c38 */ void (*Unk88)(entity_t *, s32);
    /* 0x168 80089c3c */ void (*Unk89)(entity_t *);
    /* 0x16C 80089c40 */ void (*Unk90)(entity_t *);
    /* 0x170 80089c44 */ s32 (*Unk91)(entity_t *);
    /* 0x174 80089c48 */ void (*Unk92)(entity_t *);
    /* 0x178 80089c4c */ void (*Unk93)(entity_t *);
    /* 0x17C 80089c50 */ s32 (*Unk94)(entity_t *);
    /* 0x180 80089c54 */ void (*Unk95)(entity_t *);
} entity_vtable_t;

typedef struct entity {
    /* 0x00 */ entity_vtable_t *vtable;
    /* 0x04 */ s32 m_Unk0;
    /* 0x08 */ s32 m_Unk1;
    /* 0x0C */ s32 m_Unk2;
    /* 0x10 */ s32 m_Unk3;
    /* 0x14 */ s32 m_Unk4;
    /* 0x18 */ s32 m_Unk5;
    /* 0x1C */ s32 m_Unk6;
    /* 0x20 */ s32 m_Unk7;
    /* 0x24 */ s32 m_Unk8;
    /* 0x28 */ s32 m_Unk9;
    /* 0x2C */ s32 m_Unk10;
    /* 0x30 */ s32 m_Unk11;
    /* 0x34 */ s32 m_Unk12;
    /* 0x38 */ s32 m_Unk13;
    /* 0x3C */ s32 m_Unk14;
    /* 0x40 */ s32 m_Unk15;
    /* 0x44 */ s32 m_Unk16;
    /* 0x48 */ s32 m_Unk17;
    /* 0x4C */ s32 m_Unk18;
    /* 0x50 */ s32 m_Unk19;
    /* 0x54 */ s32 m_Unk20;
    /* 0x58 */ s32 m_Unk21;
    /* 0x5C */ s32 m_Unk22;
    /* 0x60 */ s32 m_Unk23;
    /* 0x64 */ s32 m_Unk24;
    /* 0x68 */ s32 m_Unk25;
    /* 0x6C */ s32 m_Unk26;
    /* 0x70 */ s32 m_Unk27;
    /* 0x74 */ s32 m_Unk28;
    /* 0x78 */ s32 m_Unk29;
    /* 0x7C */ s32 m_Unk30;
    /* 0x80 */ s32 m_Unk31;
    /* 0x84 */ s32 m_Unk32;
    /* 0x88 */ s32 m_Unk33;
    /* 0x8C */ s32 m_Unk34;
    /* 0x90 */ s32 m_Unk35;
    /* 0x94 */ s32 m_Unk36;
    /* 0x98 */ s32 m_EntityID;
    /* 0x9C */ s32 m_EntityContext;
    /* 0xA0 */ s32 m_Unk39;
    /* 0xA4 */ s32 m_Unk40;
    /* 0xA8 */ s32 m_Unk41;
    /* 0xAC */ s32 m_Unk42;
    /* 0xB0 */ s32 m_Unk43;
    /* 0xB4 */ s32 m_Unk44;
    /* 0xB8 */ s32 m_Unk45;
    /* 0xBC */ s32 m_Unk46;
    /* 0xC0 */ s32 m_Unk47;
    /* 0xC4 */ s32 m_Unk48;
    /* 0xC8 */ s32 m_Unk49;
    /* 0xCC */ s32 m_Unk50;
    /* 0xD0 */ s32 m_Unk51;
    /* 0xD4 */ s32 m_Unk52;
    /* 0xD8 */ s32 m_Unk53;
    /* 0xDC */ s32 m_Unk54;
    /* 0xE0 */ s32 m_Unk55;
    /* 0xE4 */ s32 m_Unk56;
    /* 0xE8 */ s32 m_Unk57;
    /* 0xEC */ s32 m_Unk58;
    /* 0xF0 */ s32 m_Unk59;
    /* 0xF4 */ s32 m_Unk60;
    /* 0xF8 */ s32 m_Unk61;
    /* 0xFC */ s32 m_Unk62;
    /* 0x100 */ class_305B0_t *m_Class_305B0;
    /* 0x104 */ s32 m_Unk64;
    /* 0x108 */ s32 m_Unk65;
} entity_t;

typedef struct {
    /* 0x00 */ s8 mood_effect[2];
    /* 0x02 */ s8 unlock;
    /* 0x03 */ s8 behaviour;
    /* 0x04 */ s8 interaction_type;
    /* 0x05 */ s8 interaction_range;
    /* 0x06 */ s8 interaction_angle;
    /* 0x07 */ s8 link_stage;
    /* 0x08 */ s8 event_video_id;
    /* 0x09 */ s8 interaction_param;
    /* 0x0A */ s8 proximity;
    /* 0x0B */ s8 link_flag;

    /* 0x0C */ void (*behaviour_fn)(entity_t *This, void *);
} entity_prop_t;

typedef struct {
    /* 0x00 */ s32 entity_id;
    /* 0x04 */ s32 current_tick;
    /* 0x08 */ entity_t *entity_cls_1;
    /* 0x0C */ entity_t *entity_cls_2;
    /* 0x10 */ s32 update_flags;
} entity_context_t;

entity_t *entity_create(s32 Unk1, s32 Unk2, s32 Unk3);
entity_vtable_t *entity_get_vtable();

#endif // LSD_ENTITY_H